package Test;

/*
   腾讯笔试——安排座位（动态规划）
   安排座位。只有一排位置，
   并且位置总数恰好等于参加聚会的人数。两个来自相同系的同学不可以座位相邻。
   希望知道有多少种不同的合理安排座位的方法（任意两个合理的安排方法，只要有一个位置的同学不同，都被认为是不同的）。
 */
/*
输入：
输入第一行为T，表示有T组测试数据。
每组数据一个N开始，表示一共有多少个系。下面的一行包含N个整数Ai，表示每个系的到场人数。
1 <= T <= 47
1 <= N, Ai <= 47
1 <= Sum(Ai) <= 447

输出：
对每组数据，先输出为第几组数据，然后输出结果。由于结果可能很大，输出对1,000,000,007 取余后的结果。

 输入数据：3 2 1 2 2 1 3 3 1 2 3

 输出：
         2
        0
        120

 */
/*
    解题思路：
    1.
    2.
    3.
 */
public class dynamicProgram {
    //判断先有的方案是否与新方案重复
    public static Boolean Compare(int [] i,int [][]j){
        return true;
    }

}
